{
  "Linkedin": [
    {
      "title": "1.) Learn: What makes a strong Linkedin profile",
      "description": [
        "Read at least one article about what makes a strong profile and take notes for later. Think about how you can apply what you learned to your own situation. What aspects of yourself do you need to emphasize and express to potential employers?"
      ],
      "button": "See Articles"
    },
    {
      "title": "2.) Write first draft of the ‘about me’ section for LinkedIn profile",
      "description": [
        "Write this statement in word to save it and work on it over multiple days. Today, just work on the inital draft. Look back at your notes about what makes you special and what you want to include to be memorable. "
      ],
      "button": ""
    },
    {
      "title": "3.) Write second draft of ‘about me’ section",
      "description": [
        "Re-read what you wrote and add more details or edit as needed. "
      ],
      "button": ""
    },
    {
      "title": "4.) External proofread & feedback ",
      "description": [
        "Ask 1-2 people to proofread your ‘about me’ statement and get feedback. It’s important that there are no errors in this section so the more people that read it and give you feedback, the better!"
      ],
      "button": ""
    },
    {
      "title": "5.) LinkedIn profile feedback",
      "description": [
        "Ask a friend, colleague or mentor for feedback on your profile. It’s helpful to get both people who know you and don’t know you feedback to get different perspectives on how to improve your profile. "
      ],
      "button": ""
    },
    {
      "title": "6.) Research Keywords",
      "description": [
        "On LinkedIn, look at job listings that you are interested in and make a list of ‘skills’ keywords they require. You are allowed to list 50 skills, so make sure you research all the ones job listings that you are interested are looking for. Look at many different job posts, as they will list different skills in each. "
      ],
      "button": "Learn more"
    },
    {
      "title": "7.) Explore and research other LinkedIn profiles",
      "description": [
        "Make notes of words, features and ideas that other strong profiles use on their pages. Pay attention to their photo, banner, ‘about me’ section and even the types of posts they share. Highlight what you could use in your own profile and brainstorm other aspects that are important to include in order to showcase all important ideas about you. You are unique and special - so let’s showcase this to make your story memorable!"
      ],
      "button": ""
    },
    {
      "title": "8.) Upload Your LinkedIn profile picture",
      "description": [
        "Take multiple different pictures for your profile against a plain background with no distractions. You might take it against a brightly coloured wall or fun mural if it suits your personality."
      ],
      "button": ""
    },
    {
      "title": "9.) Canva profile design",
      "description": [
        "Create a profile picture and banner on Canva for your LinkedIn profile. Play around and think about what image or feeling you want to share with people about yourself. Remember, pictures do speak loud and you are sending a powerful message with whatever you choose."
      ],
      "button": "Learn more"
    },
    {
      "title": "10.) Create and/or update LinkedIn profile.",
      "description": [
        "If you don’t already have a LinkedIn account. Sign up and create one. ",
        "Then, add your profile picture, banner, ‘about me’ section, job experience with relevant ‘skills’ keywords and educational experience. You are allowed 50 skills in your profile and you should use them all. Refer back to your notes to check if there is anything else you want to add.",
        "Next, change your LinkedIn URL to your name so that it’s easier to share with others. "
      ],
      "button": "Learn more"
    }
  ]
}
